In [1]:
import sqlite3
import pandas as pd
connection = sqlite3.connect('soccer_database.sqlite')
print("Database opened successfully")

Database opened successfully

In [2]:
tables = pd.read_sql("SELECT * FROM sqlite_master WHERE type='table';", connection)
print(tables)

    type               name           tbl_name  rootpage  \
0  table    sqlite_sequence    sqlite_sequence         4
1  table  Player_Attributes  Player_Attributes        11
2  table             Player             Player        14
3  table              Match              Match        18
4  table             League             League        24
5  table            Country            Country        26
6  table               Team               Team        29
7  table    Team_Attributes    Team_Attributes         2

                                                 sql
0             CREATE TABLE sqlite_sequence(name,seq)
1  CREATE TABLE "Player_Attributes" (\n\t`id`\tIN...
2  CREATE TABLE `Player` (\n\t`id`\tINTEGER PRIMA...
3  CREATE TABLE `Match` (\n\t`id`\tINTEGER PRIMAR...
4  CREATE TABLE `League` (\n\t`id`\tINTEGER PRIMA...
5  CREATE TABLE `Country` (\n\t`id`\tINTEGER PRIM...
6  CREATE TABLE "Team" (\n\t`id`\tINTEGER PRIMARY...
7  CREATE TABLE `Team_Attributes` (\n\t`id`\tINTE...

In [3]:
countries = pd.read_sql("SELECT * FROM Country;", connection)
countries.head()

      id     name
0      1  Belgium
1   1729  England
2   4769   France
3   7809  Germany
4  10257    Italy

In [4]:
selected_players = pd.read_sql_query("SELECT * FROM Player WHERE height >= 180 AND weight >= 170 ", connection)
print(selected_players)

         id  player_api_id            player_name  player_fifa_api_id  \
0         1         505942     Aaron Appindangoye              218353
1         4          30572          Aaron Galindo              140161
2         9         528212           Aaron Lennox              206592
3        11          23889          Aaron Mokoena               47189
4        17         161644  Aaron Taylor-Sinclair              213569
...     ...            ...                    ...                 ...
4871  11067          56929         Zoran Rendulic              188593
4872  11070         282473         Zouhair Feddal              205705
4873  11072         111182           Zsolt Laczko              164680
4874  11074          35506    Zurab Khizanishvili               47058
4875  11075          39902     Zvjezdan Misimovic              102359

                 birthday  height  weight
0     1992-02-29 00:00:00  182.88     187
1     1982-05-08 00:00:00  182.88     198
2     1993-02-19 00:00:00  190.50     181
3     1980-11-25 00:00:00  182.88     181
4     1991-04-08 00:00:00  182.88     176
...                   ...     ...     ...
4871  1984-05-22 00:00:00  190.50     179
4872  1989-01-01 00:00:00  190.50     172
4873  1986-12-18 00:00:00  182.88     176
4874  1981-10-06 00:00:00  185.42     172
4875  1982-06-05 00:00:00  180.34     176

[4876 rows x 7 columns]

In [5]:
connection.close()